In [1]:
import numpy as np
import pandas as pd

In [2]:
# sorting : sorting data in ascending (a to z) or descending (z to a) order
# filtering : gettting perticular data based on codition and our requirements!

In [3]:
data = {
     'name' : ['Python', "Java", "C", "C++", "PHP"],
     'age' : [12, 21, 10, 23, 20]
}

In [4]:
data

{'name': ['Python', 'Java', 'C', 'C++', 'PHP'], 'age': [12, 21, 10, 23, 20]}

In [5]:
df = pd.DataFrame(data)

In [6]:
df

     name  age
0  Python   12
1    Java   21
2       C   10
3     C++   23
4     PHP   20

In [7]:
# to sort data : 

df.values

array([['Python', 12],
       ['Java', 21],
       ['C', 10],
       ['C++', 23],
       ['PHP', 20]], dtype=object)

In [8]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [10]:
df.sort_index(ascending=False)

     name  age
4     PHP   20
3     C++   23
2       C   10
1    Java   21
0  Python   12

In [12]:
df.sort_values(by='age', ascending=False)

     name  age
3     C++   23
1    Java   21
4     PHP   20
0  Python   12
2       C   10

In [14]:
df.sort_values(by="name", ascending=False)

     name  age
0  Python   12
4     PHP   20
1    Java   21
3     C++   23
2       C   10

In [15]:
# sort_index : sort data based indicies, and sort_values : sort data based on values or column names

In [16]:
df

     name  age
0  Python   12
1    Java   21
2       C   10
3     C++   23
4     PHP   20

In [17]:
df[df['age'] > 18]

   name  age
1  Java   21
3   C++   23
4   PHP   20

In [22]:
df[(df['age'] > 5) & (df['age'] < 50)]

     name  age
0  Python   12
1    Java   21
2       C   10
3     C++   23
4     PHP   20

In [23]:
df.query('age > 18')

   name  age
1  Java   21
3   C++   23
4   PHP   20

In [ ]:
# np.where